Revit 2026 API

# NurbSplineCreateCurve(HermiteSpline) Method

---

Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Curve CreateCurve(
	HermiteSpline hermiteSpline
)
```
```vb
Public Shared Function CreateCurve (
	hermiteSpline As HermiteSpline
) As Curve
```
```cpp
public:
static Curve^ CreateCurve(
	HermiteSpline^ hermiteSpline
)
```
```fsharp
static member CreateCurve :
        hermiteSpline : HermiteSpline -> Curve
```

#### Parameters

hermiteSpline HermiteSpline
     The HermiteSpline that will be converted.

#### Return Value

Curve The new Curve object.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given hermite spline has to be non-periodic. -or- Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance). |
| ArgumentNullException | A non-optional argument was NULL |

The function does not support periodic Hermite curve.

#### Reference

NurbSpline Class

CreateCurve Overload

Autodesk.Revit.DB Namespace